app/Controllers/Admin/Users.php

    public function index()
    {
        $userModel = new UserModel();
        $data = [
            'page_title' => 'Manajemen Pengguna',
            'users' => $userModel->orderBy('id', 'DESC')->findAll()
---
SELECT *
FROM `users`
ORDER BY `id` DESC