app/Controllers/Admin.php

SELECT *
FROM `users`
WHERE `status` = 'pending_approval'
ORDER BY `created_at` DESC
---
    public function pendingApprovals()
    {
        $userModel = new UserModel();

        $data = [
            'page_title' => 'Persetujuan Pengguna',
            'pendingUsers' => $userModel->where('status', 'pending_approval')->orderBy('created_at', 'DESC')->findAll()

SELECT *
FROM `users`
WHERE `users`.`id` = '10'
UPDATE `users` SET `status` = 'rejected', `updated_at` = '2025-06-24 13:37:52'
WHERE `users`.`id` IN ('10')
---
    public function reject($id)
    {
        $userModel = new \App\Models\UserModel();
        $user = $userModel->find($id);

        if (!$user || $user['status'] !== 'pending_approval') {
            return redirect()->to('/admin/pending-approvals')->with('error', 'User tidak valid atau sudah diproses.');
        }

        // UBAH DARI DELETE MENJADI UPDATE STATUS
        $userModel->update($id, ['status' => 'rejected']);