app/Controllers/Auth.php

    public function attemptLogin()
    {
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $userModel = new \App\Models\UserModel();
        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'zuhudqolbu@gmail.com'
 LIMIT 1

    public function verifyEmail()
    {
        $token = $this->request->getGet('token');
        if (!$token) {
            return redirect()->to('/login')->with('error', 'Token verifikasi tidak ditemukan.');
        }
        $userModel = new UserModel();
        $user = $userModel->where('verification_token', $token)->first();
---
SELECT *
FROM `users`
WHERE `verification_token` = '9c368d8c4e215ccb0e25f4f687e35965f86cc607'
 LIMIT 1