app/Controllers/Dashboard.php

    public function index()
    {
        // 1. TANGKAP FILTER TANGGAL DARI URL. JIKA TIDAK ADA, GUNAKAN DEFAULT BULAN INI.
        $startDate = $this->request->getGet('start_date') ?? date('Y-m-01');
        $endDate = $this->request->getGet('end_date') ?? date('Y-m-t');

        $coaModel = new CoaModel();
        $detailModel = new JurnalDetailModel();
        $headerModel = new JurnalHeaderModel();

        // --- FUNGSI HELPER UNTUK PERHITUNGAN ---

        // Fungsi untuk menghitung saldo akhir akun ASET, LIABILITAS, EKUITAS (posisi per tanggal akhir)
        $getNeracaBalance = function ($accountId, $saldoAwal, $endDate) use ($detailModel) {
            $builder = $detailModel->builder();
            $builder->select('SUM(debit) as total_debit, SUM(kredit) as total_kredit');
            $builder->join('jurnal_header', 'jurnal_header.id_jurnal = jurnal_detail.id_jurnal');
            $builder->where('jurnal_detail.id_akun', $accountId);
            $builder->where('jurnal_header.tanggal_jurnal <=', $endDate); // Semua transaksi sampai tanggal akhir
            $movement = $builder->get()->getRow();
---
SELECT SUM(debit) as total_debit, SUM(kredit) as total_kredit
FROM `jurnal_detail`
JOIN `jurnal_header` ON `jurnal_header`.`id_jurnal` = `jurnal_detail`.`id_jurnal`
WHERE `jurnal_detail`.`id_akun` = '14'
AND `jurnal_header`.`tanggal_jurnal` <= '2025-06-30'