app/Controllers/Jurnal.php

    public function index()
    {
        $headerModel = new JurnalHeaderModel();
        $data = [
            'journals' => $headerModel->orderBy('tanggal_jurnal', 'DESC')->findAll(),
        ];
---
SELECT *
FROM `jurnal_header`
ORDER BY `tanggal_jurnal` DESC

    public function detail($id)
    {
        $headerModel = new JurnalHeaderModel();
        $detailModel = new JurnalDetailModel();

        // 1. Ambil data header jurnal berdasarkan ID
        $journalHeader = $headerModel->find($id);

        // 2. Ambil data detail jurnal, gabungkan (JOIN) dengan tabel Akun (COA)
        $builder = $detailModel->builder();
        $builder->select('jurnal_detail.*, chart_of_accounts.nama_akun, chart_of_accounts.kode_akun');
        $builder->join('chart_of_accounts', 'chart_of_accounts.id_akun = jurnal_detail.id_akun');
        $builder->where('jurnal_detail.id_jurnal', $id);
        $journalDetails = $builder->get()->getResultArray();
---
SELECT `jurnal_detail`.*, `chart_of_accounts`.`nama_akun`, `chart_of_accounts`.`kode_akun`
FROM `jurnal_detail`
JOIN `chart_of_accounts` ON `chart_of_accounts`.`id_akun` = `jurnal_detail`.`id_akun`
WHERE `jurnal_detail`.`id_jurnal` = '11'