app/Controllers/Laporan.php

    public function bukuBesar()
    {
        $coaModel = new CoaModel();
        $detailModel = new JurnalDetailModel();

        // 1. Ambil id_akun dari request GET (dari form filter)
        $selectedAccountId = $this->request->getGet('id_akun');

        // Siapkan variabel untuk menampung hasil
        $reportData = [];
        $selectedAccount = null;

        // 2. Jika ada akun yang dipilih, jalankan query
        if ($selectedAccountId) {
            // Ambil info akun yang dipilih
            $selectedAccount = $coaModel->find($selectedAccountId);

            // Query untuk mengambil detail jurnal
            $builder = $detailModel->builder();
            $builder->select('jurnal_detail.*, jurnal_header.tanggal_jurnal, jurnal_header.deskripsi');
            $builder->join('jurnal_header', 'jurnal_header.id_jurnal = jurnal_detail.id_jurnal');
            $builder->where('jurnal_detail.id_akun', $selectedAccountId);
            $builder->orderBy('jurnal_header.tanggal_jurnal', 'ASC'); // Penting: urutkan dari tanggal terlama
            $reportData = $builder->get()->getResultArray();
---
SELECT `jurnal_detail`.*, `jurnal_header`.`tanggal_jurnal`, `jurnal_header`.`deskripsi`
FROM `jurnal_detail`
JOIN `jurnal_header` ON `jurnal_header`.`id_jurnal` = `jurnal_detail`.`id_jurnal`
WHERE `jurnal_detail`.`id_akun` = '14'
ORDER BY `jurnal_header`.`tanggal_jurnal` ASC

    public function labaRugi()
    {
        // Ambil tanggal dari form filter, jika tidak ada, gunakan default bulan ini
        $startDate = $this->request->getGet('start_date') ?? date('Y-m-01');
        $endDate = $this->request->getGet('end_date') ?? date('Y-m-t');

        $coaModel = new CoaModel();
        $detailModel = new JurnalDetailModel();

        // 1. Ambil semua akun yang termasuk kategori Pendapatan
        $pendapatanAccounts = $coaModel->where('kategori_akun', 'Pendapatan')->findAll();
        $pendapatanDetails = [];
        $totalPendapatan = 0;

        foreach ($pendapatanAccounts as $account) {
            $builder = $detailModel->builder();
            $builder->selectSum('kredit', 'total_kredit');
            $builder->selectSum('debit', 'total_debit');
            $builder->join('jurnal_header', 'jurnal_header.id_jurnal = jurnal_detail.id_jurnal');
            $builder->where('jurnal_detail.id_akun', $account['id_akun']);
            $builder->where('jurnal_header.tanggal_jurnal >=', $startDate);
            $builder->where('jurnal_header.tanggal_jurnal <=', $endDate);
            $query = $builder->get()->getRow();
---
SELECT SUM(`kredit`) AS `total_kredit`, SUM(`debit`) AS `total_debit`
FROM `jurnal_detail`
JOIN `jurnal_header` ON `jurnal_header`.`id_jurnal` = `jurnal_detail`.`id_jurnal`
WHERE `jurnal_detail`.`id_akun` = '24'
AND `jurnal_header`.`tanggal_jurnal` >= '2025-06-01'
AND `jurnal_header`.`tanggal_jurnal` <= '2025-09-30'